{
  "_class_name": "T2IAdapter",
  "_diffusers_version": "0.21.0.dev0",
  "_name_or_path": "valhalla/t2i-canny-low-detect-res",
  "adapter_type": "full_adapter_xl",
  "channels": [
    320,
    640,
    1280,
    1280
  ],
  "downscale_factor": 16,
  "in_channels": 3,
  "num_res_blocks": 2
}
