{
  "_class_name": "T2IAdapter",
  "_diffusers_version": "0.18.0.dev0",
  "adapter_type": "full_adapter",
  "channels": [
    320,
    640,
    1280,
    1280
  ],
  "in_channels": 3,
  "num_res_blocks": 2
}
